function y_final = SOL4(f, x0, xend, y0, N, n0, n1, n2)
%f - массив указателей на функции правых частей
% f{i}(x,y) — i-й компонент f
%x0 - начальная абсцисса расчёта
%xend - конечная абсцисса расчёт
%y0 - вектор начальных переменных
%N - число шагов
%[n0 n1 n2] - количество уравнений в общей, первой и второй структурных
%группах соответственно

%constants
h = (xend-x0)/N;
neq = n0 + n1 + n2;
x_start = x0;
y1 = zeros(neq,1);

%1 - первый индекс в нулевой группе
% n0 — последний индекс во нулевой группе
n11 = n0 + 1; % первый индекс в первой группе
n12 = n0 + n1; % последний индекс в первой группе
n21 = n12 + 1; % первый индекс во второй группе
n22 = n12 + n2; % n22 = neq — общее число уравнений, последний индекс во второй группе

% переменные для компенсации
z = zeros(neq,1);
term = zeros(neq,1);
newy = zeros(neq,1);

% аргументы K — X, Y
for j = 1:N
    % Первый этап
    K1 = zeros(neq,1);
    % Группа 0
    X = x0; % начальная точка
    Y = y0; % начальная точка
    for i = 1:n0
        K1(i) = h * f(X,Y,i);
    end

    % Группа 1
    X = x0; % начальная точка
    Y = y0; % начальная точка
    for i = n11:n12
        K1(i) = h * f(X,Y,i);
    end

    % Группа 2
    X = x0 + 1/6 * h;
    Y = y0 + 1/6 * K1;
    for i = n21:n22
        K1(i) = h * f(X,Y,i);
        Y(i) = y0(i) + 1/6 * K1(i);
    end

    % Второй этап
    K2 = zeros(neq,1);
    % Группа 0
    X = x0 + 1/3 * h;
    Y = y0 + 1/3 * K1;
    for i = 1:n0
        K2(i) = h * f(X,Y,i);
    end

    % Группа 1
    X = x0 + 1/3 * h;
    Y(1:n0) = y0(1:n0) + 1/6 * K1(1:n0) + 1/6 * K2(1:n0); % По группе 0
    Y(n21:n22) = y0(n21:n22) + 1/3 * K1(n21:n22); % По группе 2

    for i = n11:n12
        K2(i) = h * f(X,Y,i);
        Y(i) = y0(i) + 1/6 * K1(i) + 1/6 * K2(i);
    end
    
    % Группа 2
    X = x0 + 2/3 * h;
    Y(1:n0) = y0(1:n0) - 1/12 * K1(1:n0) + 3/4 * K2(1:n0);
    Y(n11:n12) = y0(n11:n12) - 1/12 * K1(n11:n12) + 3/4 * K2(n11:n12);
    
    for i=n21:n22
        K2(i) = h * f(X,Y,i);
        Y(i) = y0(i) + 1/2 * K1(i) + 1/6 * K2(i);
    end
    
    % Третий этап
    K3 = zeros(neq,1);
    %группа 0
    X = x0 + 2/3 * h;
    Y(1:n0) = y0(1:n0) - 1/3 * K1(1:n0) + K2(1:n0);
    Y(n11:n12) = y0(n11:n12) - 1/3 * K1(n11:n12) + K2(n11:n12);
    Y(n21:n22) = y0(n21:n22) + 4/9 * K1(n21:n22) + 2/9 * K2(n21:n22);
    for i = 1:n0
        K3(i) = h * f(X,Y,i);
    end
    
    % Группа 1
    X = x0 + 5/6 * h;
    Y(1:n0) = y0(1:n0) + 5/48 * K1(1:n0) + 5/12 * K2(1:n0) + 5/16 * K3(1:n0); % По группе 0
    Y(n21:n22) = y0(n21:n22) + 5/12 * K1(n21:n22) + 5/12 * K2(n21:n22); % По группе 2

    for i = n11:n12
        K3(i) = h * f(X,Y,i);
        Y(i) = y0(i) + 1/24 * K1(i) + 5/8 * K2(i) + 1/6 * K3(i);
    end
    
    % Группа 2
    X = x0 + h;
    Y(1:n0) = y0(1:n0) + K1(1:n0) - 5/4 * K2(1:n0) + 5/4 * K3(1:n0);
    Y(n11:n12) = y0(n11:n12) + 3/4 * K1(n11:n12) - 5/12 * K2(n11:n12) + 2/3 * K3(n11:n12);
    
    for i=n21:n22
        K3(i) = h * f(X,Y,i);
        Y(i) = y0(i) + 1/6 * K1(i) + 5/6 * K2(i);
    end
    
    % Четвёртый этап
    K4 = zeros(neq,1);
    %группа 0
    X = x0 + h;
    Y(1:n0) = y0(1:n0) + K1(1:n0) - K2(1:n0) + K3(1:n0);
    Y(n11:n12) = y0(n11:n12) + 4/5 * K1(n11:n12) - 1/3 * K2(n11:n12) + 8/15 * K3(n11:n12);
    Y(n21:n22) = y0(n21:n22) + 1/3 * K1(n21:n22) + 2/3 * K2(n21:n22);
    for i = 1:n0
        K4(i) = h * f(X,Y,i);
    end

    % Итог
    term(1:n0) = 1/8 * (K1(1:n0) + 3 * K2(1:n0) + 3 * K3(1:n0) + K4(1:n0)) + z(1:n0);
    term(n11:n12) = 1/10 * (K1(n11:n12) + 5 * K2(n11:n12) + 4 * K3(n11:n12)) + z(n11:n12);
    term(n21:n22) = 1/10 * (4 * K1(n21:n22) + 5 * K2(n21:n22) + K3(n21:n22)) + z(n21:n22);
    
    newy(1:n0) = y0(1:n0) + term(1:n0);
    newy(n11:n12) = y0(n11:n12) + term(n11:n12);
    newy(n21:n22) = y0(n21:n22) + term(n21:n22);
    
    z(1:n0) = term(1:n0) - (newy(1:n0) - y0(1:n0));
    z(n11:n12) = term(n11:n12) - (newy(n11:n12) - y0(n11:n12));
    z(n21:n22) = term(n21:n22) - (newy(n21:n22) - y0(n21:n22));
    
    y1(1:n0) = newy(1:n0);
    y1(n11:n12) = newy(n11:n12);
    y1(n21:n22) = newy(n21:n22);
    
    x0 = x_start + j*h;
    y0 = y1; % Для следующего шага
end

y_final = y1;
end